Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_qp.c
	/*
	 * If the QP is part of an MCG, then we fail the qp_free
	 */
	if (qp->qp_mcg_refcnt != 0) {
		mutex_exit(&qp->qp_lock);
		status = DDI_FAILURE;
		goto qpfree_fail;
	}

	/*
	 * If the QP is not already in "Reset" state, then transition to
	 * "Reset".  This is necessary because software does not reclaim
	 * ownership of the QP context until the QP is in the "Reset" state.
	 * If the ownership transfer fails for any reason, then it is an
	 * indication that something (either in HW or SW) has gone seriously
	 * wrong.  So we print a warning message and return.
	 */
	if (qp->qp_state != MCXNEX_QP_RESET) {
		if (mcxnex_qp_to_reset(state, qp) != DDI_SUCCESS) {
			mutex_exit(&qp->qp_lock);
			MCXNEX_WARNING(state, "failed to reset QP context");
			status = DDI_FAILURE;
			goto qpfree_fail;
		}
		qp->qp_state = MCXNEX_QP_RESET;

		/*
		 * Do any additional handling necessary for the transition
		 * to the "Reset" state (e.g. update the WRID lists)
		 */
		if (mcxnex_wrid_to_reset_handling(state, qp) != DDI_SUCCESS) {
			mutex_exit(&qp->qp_lock);
			MCXNEX_WARNING(state, "failed to reset QP WRID list");
			status = DDI_FAILURE;
			goto qpfree_fail;
		}
	}

	/*
	 * If this was a user-mappable QP, then we need to remove its entry
	 * from the "userland resources database".  If it is also currently
	 * mmap()'d out to a user process, then we need to call
	 * devmap_devmem_remap() to remap the QP memory to an invalid mapping.
	 * We also need to invalidate the QP tracking information for the
	 * user mapping.
	 */
	if (qp->qp_is_umap) {
		status = mcxnex_umap_db_find(state->hs_instance, qp->qp_qpnum,
		    MLNX_UMAP_QPMEM_RSRC, &value, MCXNEX_UMAP_DB_REMOVE,
		    &umapdb);
		if (status != DDI_SUCCESS) {
			mutex_exit(&qp->qp_lock);
			MCXNEX_WARNING(state, "failed to find in database");
			return (DDI_FAILURE);
		}
		mcxnex_umap_db_free(umapdb);
		if (qp->qp_umap_dhp != NULL) {
			maxprot = (PROT_READ | PROT_WRITE | PROT_USER);
			status = devmap_devmem_remap(qp->qp_umap_dhp,
			    state->hs_dip, 0, 0, qp->qp_wqinfo.qa_size,
			    maxprot, DEVMAP_MAPPING_INVALID, NULL);
			if (status != DDI_SUCCESS) {
				mutex_exit(&qp->qp_lock);
				MCXNEX_WARNING(state, "failed in QP memory "
				    "devmap_devmem_remap()");
				return (DDI_FAILURE);
			}
			qp->qp_umap_dhp = (devmap_cookie_t)NULL;
		}
	}


	/*
	 * Put NULL into the Mcxnex QPNum-to-QPHdl list.  This will allow any
	 * in-progress events to detect that the QP corresponding to this
	 * number has been freed.  Note: it does depend in whether we are
	 * freeing a special QP or not.
	 */
	if (qp->qp_is_special) {
		state->hs_qphdl[qpc->hr_indx + port] = NULL;
	} else {
		state->hs_qphdl[qpc->hr_indx] = NULL;
	}

	/*
	 * Drop the QP lock
	 *    At this point the lock is no longer necessary.  We cannot
	 *    protect from multiple simultaneous calls to free the same QP.
	 *    In addition, since the QP lock is contained in the QP "software
	 *    handle" resource, which we will free (see below), it is
	 *    important that we have no further references to that memory.
	 */
	mutex_exit(&qp->qp_lock);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*qp))

	/*
	 * Free the QP resources
	 *    Start by deregistering and freeing the memory for work queues.
	 *    Next free any previously allocated context information
	 *    (depending on QP type)
	 *    Finally, decrement the necessary reference counts.
	 * If this fails for any reason, then it is an indication that
	 * something (either in HW or SW) has gone seriously wrong.  So we
	 * print a warning message and return.
	 */
	status = mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
	    sleepflag);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister QP memory");
		status = DDI_FAILURE;
		goto qpfree_fail;
	}

	/* Free the memory for the QP */
	mcxnex_queue_free(&qp->qp_wqinfo);

	if (qp->qp_sq_wqhdr)
		mcxnex_wrid_wqhdr_destroy(qp->qp_sq_wqhdr);
	if (qp->qp_rq_wqhdr)
		mcxnex_wrid_wqhdr_destroy(qp->qp_rq_wqhdr);

	/* Free the dbr */
	if (!qp_srq_en) {
		mcxnex_dbr_free(state, qp->qp_uarpg, qp->qp_rq_vdbr);
	}

	/*
	 * Free up the remainder of the QP resources.  Note: we have a few
	 * different resources to free up depending on whether the QP is a
	 * special QP or not.  As described above, if any of these fail for
	 * any reason it is an indication that something (either in HW or SW)
	 * has gone seriously wrong.  So we print a warning message and
	 * return.
	 */
	if (qp->qp_is_special) {
		type = (qp->qp_is_special == MCXNEX_QP_SMI) ?
		    IBT_SMI_SQP : IBT_GSI_SQP;

		/* Free up resources for the special QP */
		status = mcxnex_special_qp_rsrc_free(state, type, port);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to free special QP rsrc");
			status = DDI_FAILURE;
			goto qpfree_fail;
		}

	} else {
		type = qp->qp_serv_type;

		/*
		 * Check the flags and determine whether to release the
		 * QPN or not, based on their value.
		 */
		if (free_qp_flags == IBC_FREE_QP_ONLY) {
			entry = qp->qp_qpn_hdl;
			mcxnex_qp_release_qpn(state, qp->qp_qpn_hdl,
			    MCXNEX_QPN_FREE_ONLY);
			*qpnh = (ibc_qpn_hdl_t)entry;
		} else {
			mcxnex_qp_release_qpn(state, qp->qp_qpn_hdl,
			    MCXNEX_QPN_RELEASE);
		}
	}
	mutex_destroy(&qp->qp_sq_lock);
	mutex_destroy(&qp->qp_rq_lock);

	/* Free the Mcxnex Queue Pair handle */
	mcxnex_rsrc_free(state, &rsrc);

	/* Decrement the reference counts on CQs, PD and SRQ (if needed) */
	mcxnex_cq_refcnt_dec(rq_cq);
	mcxnex_cq_refcnt_dec(sq_cq);
	mcxnex_pd_refcnt_dec(pd);
	if (qp_srq_en == MCXNEX_QP_SRQ_ENABLED) {
		mcxnex_srq_refcnt_dec(srq);
	}

	/* Set the qphdl pointer to NULL and return success */
	*qphdl = NULL;

	return (DDI_SUCCESS);

qpfree_fail:
	return (status);
}


/*
 * mcxnex_qp_query()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_qp_query(mcxnex_state_t *state, mcxnex_qphdl_t qp,
    ibt_qp_query_attr_t *attr_p)
{
	ibt_cep_state_t		qp_state;
	ibt_qp_ud_attr_t	*ud;
	ibt_qp_rc_attr_t	*rc;
	ibt_qp_uc_attr_t	*uc;
	ibt_cep_flags_t		enable_flags;
	mcxnex_hw_addr_path_t	*qpc_path, *qpc_alt_path;
	ibt_cep_path_t		*path_ptr, *alt_path_ptr;
	mcxnex_hw_qpc_t		*qpc;
	int			status;
	uint_t			tmp_sched_q, tmp_alt_sched_q;

	mutex_enter(&qp->qp_lock);

